#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.prod_db.random_password.osem_db_master_pass: Refreshing state... [id=none]
aws_route53_record.alias: Refreshing state... [id=Z0173878287JIU5M4KB8R_alias.seagl.org_CNAME]
aws_ses_domain_identity.email_domain_identity: Refreshing state... [id=seagl.org]
data.aws_vpc.vpc: Reading...
aws_route53_record.route_53_root_txt: Refreshing state... [id=Z0173878287JIU5M4KB8R__TXT]
aws_ses_domain_identity.seagl: Refreshing state... [id=seagl.org]
aws_route53_record.route_53_dmarc_txt: Refreshing state... [id=Z0173878287JIU5M4KB8R__dmarc.seagl.org_TXT]
module.prod_db.aws_db_subnet_group.osem: Refreshing state... [id=osem]
aws_ses_email_identity.email: Refreshing state... [id=sre@seagl.org]
module.prod_db.aws_secretsmanager_secret.osem-db-pass: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:663166083306:secret:db-pass-osem-5KW1mS]
aws_s3_bucket.state: Refreshing state... [id=seagl-terraform]
aws_instance.dokku: Refreshing state... [id=i-02ee81d4bd0860d30]
aws_ses_domain_dkim.email_dkim: Refreshing state... [id=seagl.org]
aws_route53_record.seagl_amazonses_verification_record: Refreshing state... [id=Z0173878287JIU5M4KB8R__amazonses.seagl.org_TXT]
module.prod_db.aws_secretsmanager_secret_version.osem-db-pass-val: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:663166083306:secret:db-pass-osem-5KW1mS|5E8ED816-E9AA-4E8E-A382-2EEE9FC74A66]
aws_route53_record.email_dkim_records[2]: Refreshing state... [id=Z0173878287JIU5M4KB8R_o7o3tsrrlwgkmmx3a7f5njkrvi75woso._domainkey.seagl.org_CNAME]
aws_route53_record.email_dkim_records[1]: Refreshing state... [id=Z0173878287JIU5M4KB8R_zjerfwsrr5wpwp5p5klnsrrzp6ralpcp._domainkey.seagl.org_CNAME]
aws_route53_record.email_dkim_records[0]: Refreshing state... [id=Z0173878287JIU5M4KB8R_nldzqxeyq5fyslu3tzvj4ltbwbexupuj._domainkey.seagl.org_CNAME]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-231ecb46]
module.prod_db.aws_security_group.osem_rds_security_group: Refreshing state... [id=sg-006c493d98f3c7f1a]
module.prod_db.aws_security_group_rule.private_out: Refreshing state... [id=sgrule-1612436969]
module.prod_db.aws_db_instance.osem: Refreshing state... [id=osem]
module.prod_db.aws_security_group_rule.private_in: Refreshing state... [id=sgrule-3182957500]
aws_s3_bucket_public_access_block.state: Refreshing state... [id=seagl-terraform]
aws_s3_bucket_versioning.state: Refreshing state... [id=seagl-terraform]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.dokku will be updated in-place
  ~ resource "aws_instance" "dokku" {
        id                                   = "i-02ee81d4bd0860d30"
      ~ tags                                 = {
          ~ "Name" = "dokku.seagl.org" -> "dokku"
        }
      ~ tags_all                             = {
          ~ "Name" = "dokku.seagl.org" -> "dokku"
        }
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_route53_record.route_53_dmarc_txt will be updated in-place
  ~ resource "aws_route53_record" "route_53_dmarc_txt" {
        id      = "Z0173878287JIU5M4KB8R__dmarc.seagl.org_TXT"
        name    = "_dmarc.seagl.org"
      ~ records = [
          - "v=DMARC1;p=quarantine;pct=75;rua=mailto:dmarc-rpt@seagl.org",
          + "v=DMARC1;p=quarantine;rua=mailto:dmarc-rpt@seagl.org",
        ]
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.seagl_amazonses_verification_record will be created
  + resource "aws_route53_record" "seagl_amazonses_verification_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_amazonses.seagl.org"
      + records         = [
          + "P5TEkmOgwQ7P0iXXyzBuvmbcjZ8iLx92y1Fbwz9PuY0=",
        ]
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.state,
  on s3.tf line 1, in resource "aws_s3_bucket" "state":
   1: resource "aws_s3_bucket" "state" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @AndrewKvalheim, Action: `pull_request`*